In [1]:
# series는 표의 하나의 열
# index는 행의 열을 나타내는 숫자
# frame은 series를 다 합쳐놓은 거

from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [7]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
            'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'], 
            'age': [42, 52, 36, 24, 73], 
            'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city']) 
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [6]:
DataFrame(raw_data, columns = ["age","city"])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [5]:
DataFrame(raw_data, 
          columns = ["first_name","last_name","age", "city", "debt"] )

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [10]:
df = DataFrame(raw_data, columns=["first_name","last_name","age","city","debt"])
df.last_name

0      Miller
1    Jacobson
2         Ali
3      Milner
4       Cooze
Name: last_name, dtype: object

In [14]:
# 1번째 행의 정보를 출력
df.loc[1]

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
debt                NaN
Name: 1, dtype: object

In [17]:
df["age"].iloc[:3]

0    42
1    52
2    36
Name: age, dtype: int64

In [47]:
# series를 만들어주는데 값은 다 nan값을 넣어주고
# index넘버 지정
# [:2] 처음부터 시리즈 넘버 2까지만 출력
s = pd.Series(np.nan, index=[49,48,47,46,45,1,2,3,4,5])
print(s)

print()
s.loc[:47]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

49   NaN
48   NaN
47   NaN
dtype: float64

In [30]:
df.age > 40

0     True
1     True
2    False
3    False
4     True
Name: age, dtype: bool

In [31]:
# age가 40 넘는 값만 넣어줌
df.debt = df.age > 40
df

  first_name last_name  age           city   debt
0      Jason    Miller   42  San Francisco   True
1      Molly  Jacobson   52      Baltimore   True
2       Tina       Ali   36          Miami  False
3       Jake    Milner   24        Douglas  False
4        Amy     Cooze   73         Boston   True

In [32]:
df.to_dict()

{'first_name': {0: 'Jason', 1: 'Molly', 2: 'Tina', 3: 'Jake', 4: 'Amy'},
 'last_name': {0: 'Miller', 1: 'Jacobson', 2: 'Ali', 3: 'Milner', 4: 'Cooze'},
 'age': {0: 42, 1: 52, 2: 36, 3: 24, 4: 73},
 'city': {0: 'San Francisco',
  1: 'Baltimore',
  2: 'Miami',
  3: 'Douglas',
  4: 'Boston'},
 'debt': {0: True, 1: True, 2: False, 3: False, 4: True}}

In [33]:
values = Series(data=["M","F","F"], index = [0,1,3])
print(values)

0    M
1    F
3    F
dtype: object

In [34]:
df[:1]

  first_name last_name  age           city  debt
0      Jason    Miller   42  San Francisco  True

In [35]:
df["sex"]=values
df

  first_name last_name  age           city   debt  sex
0      Jason    Miller   42  San Francisco   True    M
1      Molly  Jacobson   52      Baltimore   True    F
2       Tina       Ali   36          Miami  False  NaN
3       Jake    Milner   24        Douglas  False    F
4        Amy     Cooze   73         Boston   True  NaN

In [36]:
# 열과 행을 바꿔줌 / 치환
df.T

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston
debt                 True       True  False    False    True
sex                     M          F    NaN        F     NaN

In [37]:
df.values

array([['Jason', 'Miller', 42, 'San Francisco', True, 'M'],
       ['Molly', 'Jacobson', 52, 'Baltimore', True, 'F'],
       ['Tina', 'Ali', 36, 'Miami', False, nan],
       ['Jake', 'Milner', 24, 'Douglas', False, 'F'],
       ['Amy', 'Cooze', 73, 'Boston', True, nan]], dtype=object)

In [38]:
# csv는 엑셀파일(콤마로 구별, 분리 해보는,, comma seperate?)
df.to_csv("test.csv")

In [39]:
df.head()

  first_name last_name  age           city   debt  sex
0      Jason    Miller   42  San Francisco   True    M
1      Molly  Jacobson   52      Baltimore   True    F
2       Tina       Ali   36          Miami  False  NaN
3       Jake    Milner   24        Douglas  False    F
4        Amy     Cooze   73         Boston   True  NaN

In [40]:
del df["debt"]
df

  first_name last_name  age           city  sex
0      Jason    Miller   42  San Francisco    M
1      Molly  Jacobson   52      Baltimore    F
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas    F
4        Amy     Cooze   73         Boston  NaN

In [42]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9}, 
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

DataFrame(pop)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6